<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/2_Aggregation.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Windows Functions Syntax

## Overview

### 🥅 Analysis Goals

Explore user-level metrics to understand cohort size and the average lifetime value of users in each cohort.

- **Total Users by Cohort:** Get the total number of unique users in each cohort to get insight into the scale of each cohort. Helps evaluate the relative size of cohorts, which is essential for benchmarking revenue.
- **Average LTV by Customer:** Aggregate total revenue per customer and calculate the average lifetime value for each customer. Gives the ability to assess by user their contributions, and helps understand the quality and long-term value of different cohorts.

### 📘 Concepts Covered

- `COUNT()`
- `AVG()`

### 📕 Definitions

- **Lifetime Value (LTV)**: the total revenue a customer generates for a business over their entire relationship.

In [2]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the ipython-sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## CTEs Review

**Common Table Expressions (CTEs)**

- **CTE**: A temporary result set defined within a query, often used to improve readability and manageability of complex queries.
    - CTEs are created using the `WITH` keyword and can be referenced in the main query.
    - They are reusable within the same query and make it easier to break down large queries into smaller, logical steps.

**Syntax**:
- Basic CTE
    - ```sql
      WITH cte_name AS (
        SELECT column1, column2
        FROM table_name
        WHERE condition
      )
      SELECT column1, column2
      FROM cte_name;
      ```

- CTE with multiple definitions
    - ```sql
      WITH cte1 AS (
        SELECT column1, column2
        FROM table1
        WHERE condition
      ),
      cte2 AS (
        SELECT column1, column3
        FROM table2
        WHERE condition
      )
      SELECT cte1.column1, cte2.column3
      FROM cte1
      JOIN cte2 ON cte1.column1 = cte2.column1;
      ```
- **Note**: CTEs are a cleaner alternative to subqueries for improving query organization, especially in PostgreSQL. They can also replace temporary tables in some cases, but they only exist for the duration of the query.

### 💻 Final Result

- Get the average net revenue by day (this is for reviewing CTEs and is the same example we used for reviewing subqueries).
- Groups users into cohorts based on their first order year (called `cohort_year`) to analyze long-term revenue growth.
- **Note**: The `customer` table has a `startdt` which may be when they started but since we don't have data that goes back this far (we don't have anything within this range of 1980 - 2010), we will not be using this data.

#### Average Net Revenue by Day

**CTE**

1. Using a CTE called `revenue_by_day`, get the average net revenue by day (`orderdate`).  
   - Create a subquery `revenue_by_day` to calculate the net revenue for each sale using `(quantity * netprice * exchangerate)`.  
        - Include `orderdate` in the subquery to associate each sale with its corresponding date.  
   - In the main query, calculate the average net revenue per day using `AVG(net_revenue)`.  
        - Group the results by `orderdate` to compute the average for each unique day.  
        - Use `ORDER BY orderdate` to display the results in chronological order.

In [12]:
%%sql

-- Moved subquery to a CTE
WITH revenue_by_day AS (
    SELECT 
        orderdate, 
        (quantity * netprice * exchangerate) AS net_revenue
    FROM sales
)

SELECT 
    orderdate,
    AVG(net_revenue)
FROM revenue_by_day
GROUP BY orderdate
ORDER BY orderdate;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

       orderdate     avg
0     2015-01-01  465.63
1     2015-01-02  736.30
2     2015-01-03  942.70
3     2015-01-05 1240.63
4     2015-01-06  862.49
...          ...     ...
3289  2024-04-16  784.34
3290  2024-04-17  539.98
3291  2024-04-18  498.40
3292  2024-04-19  967.74
3293  2024-04-20  998.76

[3294 rows x 2 columns]

This is what it looked like as a subquery.

In [13]:
%%sql

SELECT 
    orderdate, 
    AVG(net_revenue)
FROM (
    SELECT orderdate, (quantity * netprice * exchangerate) AS net_revenue
    FROM sales
) AS revenue_by_day
GROUP BY orderdate
ORDER BY orderdate;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

3294 rows affected.

       orderdate     avg
0     2015-01-01  465.63
1     2015-01-02  736.30
2     2015-01-03  942.70
3     2015-01-05 1240.63
4     2015-01-06  862.49
...          ...     ...
3289  2024-04-16  784.34
3290  2024-04-17  539.98
3291  2024-04-18  498.40
3292  2024-04-19  967.74
3293  2024-04-20  998.76

[3294 rows x 2 columns]

---
## COUNT

### 📝 Notes

`COUNT`

- **COUNT**: Counts the values, `DISTINCT` can be added to get the unique count.
- Syntax: 
  ```sql
    SELECT
      COUNT() OVER(
          PARTITION BY partition_expression
      ) AS window_column_alias
      FROM table_name
  ```

### 💻 Final Result

-  Get the total number of unique users in each cohort for each customer to get insight into the scale of each cohort. 
    - Helps evaluate the relative size of cohorts, which is essential for benchmarking revenue.
    - Having the customerkey would help us with downstream analyses, like calculating metrics for individual users within cohorts or grouping them further by other dimensions (e.g., regions or segments).

#### Total Count of Customers by Cohort

**`COUNT()`, `OVER`, `PARTITION BY`**

1. Get the cohorts by year from the `orderdate` and the `customerkey` in the `sales` table.
    - Use `EXTRACT(YEAR FROM MIN(orderdate))` to find the earliest year a customer placed an order.
    - Select `customerkey` to associate each customer with their cohort year.
    - Group the data by `customerkey` to calculate the cohort year for each customer.

In [ ]:
%%sql

SELECT 
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    customerkey
FROM sales
GROUP BY 
    customerkey

2. Create a CTE to calculate the cohort year for each customer and return all results in the main query.  
   - Define a CTE `cohort_analysis` to extract the cohort year for each customer.  
   - Use `EXTRACT(YEAR FROM MIN(orderdate))` in the CTE to determine the earliest order year for each customer.  
   - Group by `customerkey` in the CTE to assign each customer to a single cohort year.  
   - In the main query, use `SELECT * FROM cohort_analysis` to return all the results from the CTE.

In [7]:
%%sql

-- Put query into a CTE
WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey
    FROM sales
    GROUP BY 
        customerkey
)

-- Added
SELECT * 
FROM cohort_analysis

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey
0            2018      2044589
1            2021      1603477
2            2017       876049
3            2024      1469222
4            2018      2089398
...           ...          ...
49482        2019       853617
49483        2016      1573639
49484        2022      1355936
49485        2024       967453
49486        2022        34354

[49487 rows x 2 columns]

3. Calculate the total customers by each cohort.  
   - Use a Common Table Expression (CTE) `cohort_analysis` to assign each customer to a cohort year.  
   - Extract the earliest order year for each customer using `EXTRACT(YEAR FROM MIN(orderdate))`.  
   - Group by `customerkey` in the CTE to ensure each customer is assigned one cohort year.  
   - Use `COUNT(customerkey) OVER (PARTITION BY cohort_year)` to calculate the total number of customers for each cohort.  
   - Select `cohort_year`, `customerkey`, and `total_users` to display each customer and their cohort's total users.

In [23]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    cohort_year, -- Updated
    customerkey,
    COUNT(customerkey) OVER (PARTITION BY cohort_year) AS total_users -- Added
FROM cohort_analysis

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_users
0            2015      1088780         2825
1            2015      1404475         2825
2            2015       928010         2825
3            2015       492702         2825
4            2015       341576         2825
...           ...          ...          ...
49482        2024      1406861         1402
49483        2024       841578         1402
49484        2024       994228         1402
49485        2024      1032701         1402
49486        2024        47320         1402

[49487 rows x 3 columns]

---
## Average

### 📝 Notes

- `AVG()`: Calculates the average of the values

```sql
  SELECT
    COUNT() OVER(
         PARTITION BY partition_expression
    ) AS window_column_alias
    FROM table_name
```

### 💻 Final Result

- Aggregate total revenue per user and calculate the average lifetime value for each cohort. 
    - Gives the ability to assess by user their contributions, and helps understand the quality and long-term value of different cohorts.
    - Keeping customerkey helps us with downstream analyses, like calculating metrics for individual users within cohorts or grouping them further by other dimensions (e.g., regions or segments).

#### Average LTV by Cohort

**`AVG()`, `OVER`, `PARTITION BY`**

1. Get the `cohort_year` and the total revenue for each user.  
   - Use `EXTRACT(YEAR FROM MIN(orderdate))` to calculate the cohort year for each customer.  
   - Group by `customerkey` to ensure the revenue and cohort year are calculated per user.  
   - Calculate the total revenue for each customer using `SUM(quantity * netprice * exchangerate)`.  
   - Select `cohort_year`, `customerkey`, and the total revenue (`total_customer_net_revenue`) to display the results.

In [9]:
%%sql

SELECT 
    EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
    customerkey,
    SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
FROM sales
GROUP BY 
    customerkey

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_customer_net_revenue
0            2018      2044589                     2470.73
1            2021      1603477                      136.62
2            2017       876049                     2601.13
3            2024      1469222                     5278.54
4            2018      2089398                       98.39
...           ...          ...                         ...
49482        2019       853617                      903.31
49483        2016      1573639                     6973.42
49484        2022      1355936                      149.99
49485        2024       967453                        5.40
49486        2022        34354                      828.80

[49487 rows x 3 columns]

2. Create a CTE to calculate the cohort year for each customer and their net revenue and return all results in the main query.  
   - Define a CTE `cohort_analysis` to extract the cohort year for each customer.  
        - Use `EXTRACT(YEAR FROM MIN(orderdate))` in the CTE to determine the earliest order year for each customer. 
        - Calculate the total revenue for each customer using `SUM(quantity * netprice * exchangerate)`.  
        - Group by `customerkey` in the CTE to assign each customer to a single cohort year.  
   - In the main query, use `SELECT * FROM cohort_analysis` to return all the results from the CTE.

In [14]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey,
        SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    *
FROM cohort_analysis
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  total_customer_net_revenue
0            2018      2044589                     2470.73
1            2021      1603477                      136.62
2            2017       876049                     2601.13
3            2024      1469222                     5278.54
4            2018      2089398                       98.39
...           ...          ...                         ...
49482        2019       853617                      903.31
49483        2016      1573639                     6973.42
49484        2022      1355936                      149.99
49485        2024       967453                        5.40
49486        2022        34354                      828.80

[49487 rows x 3 columns]

3. Get the average LTV by each customer.  
   - Define a CTE `cohort_analysis` to calculate the cohort year and total revenue for each customer.  
        - Extract the cohort year using `EXTRACT(YEAR FROM MIN(orderdate))`.  
        - Calculate the total revenue for each customer with `SUM(quantity * netprice * exchangerate)`.  
        - Group by `customerkey` to ensure total revenue and cohort year are assigned to each customer.  
   - In the main query, use `AVG(total_customer_net_revenue) OVER (PARTITION BY cohort_year)` to calculate the average revenue per customer for each cohort.  
        - Select `cohort_year`, `customerkey`, and the average total revenue for output.  
        - Use `ORDER BY cohort_year, customerkey` to sort the results by cohort and customer.

In [15]:
%%sql

WITH cohort_analysis AS (
    SELECT 
        EXTRACT(YEAR FROM MIN(orderdate)) AS cohort_year,
        customerkey,
        SUM(quantity * netprice * exchangerate) AS total_customer_net_revenue
    FROM sales
    GROUP BY 
        customerkey
)

SELECT 
    cohort_year, -- Updated
    customerkey, -- Updated
    AVG(total_customer_net_revenue) OVER (PARTITION BY cohort_year) AS avg_ltv-- Added
FROM cohort_analysis
ORDER BY -- Added
    cohort_year,
    customerkey
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

49487 rows affected.

      cohort_year  customerkey  avg_ltv
0            2015         4376  5271.59
1            2015         4403  5271.59
2            2015         4925  5271.59
3            2015         5729  5271.59
4            2015         6048  5271.59
...           ...          ...      ...
49482        2024      2093965  2037.55
49483        2024      2095129  2037.55
49484        2024      2095691  2037.55
49485        2024      2096470  2037.55
49486        2024      2097541  2037.55

[49487 rows x 3 columns]

### 💡 CTEs > Subqueries 

We prefer using CTEs over subqueries for a few reasons: 
- **Improved Readability**: CTEs separate logic into named blocks, making complex queries easier to follow and understand compared to deeply nested subqueries.
- **Reusability**: CTEs can be referenced multiple times within the same query, avoiding duplication and reducing redundancy compared to repeating subqueries.
- **Debugging Friendly**: With CTEs, you can test and debug each logical step independently, whereas subqueries are harder to isolate and analyze.

We'll still use subqueries occasionally, but only for simple logic (e.g., `SELECT column_name FROM table`).